<template>
  <view class="container">
    
    <!-- 内容区域 -->
    <scroll-view class="content-scroll" scroll-y>
      <view class="content">
        <view class="section-title">服务协议</view>
        
        <view class="section">
          <view class="section-subtitle">1、导言</view>
          <view class="paragraph">感谢您选择使用"智汇社"软件及其相关服务!"智汇社"软件及其相关服务，是由吉林省李氏数字文化有限公司及其关联方(以下统称"本公司")通过网页、应用程序(可能包含多个版本)、小程序、供第三方网站和应用程序使用的软件开发工具包(SDK)、应用程序编程接口(API)以及随技术发展而衍生的其他新型态式向您提供的综合性产品与服务。</view>
          <view class="paragraph">这些服务以"AI交互对话"为核心功能，并包含其他多项辅助功能。本用户协议(以下简称"本协议")旨在明确您与本公司之间，就注册、登录、使用(以下统称"使用")本软件及其相关服务所达成的各项条款和件。</view>
          <view class="paragraph">为确保您能够充分享受我们提供的服务，敬请在开始使用本软件及其相关服务之前，仔细阅读并全面理解本协议的内容，特别是其中涉及责任免除、限制条款、权利许可、法律适用及争议解决等关键条款。对于责任免除或限制等重要内容，我们已采用加粗字体等显著方式提醒您注意，请您务必重点审阅。</view>
          <view class="paragraph">若您不同意本协议中的任何条款，我们可能无法为您提供完整的产品和服务体验。在此情况下，您有权选择停止使用本软件及其相关服务。若您选择继续使用或接受本软件及其相关服务，则视为您已充分理解本协议，并自愿作为本协议的一方当事人，接受本协议以及与之相关的其他协议和规则(包括但不限于《隐私政策》、《测试须知》)的法律约束。</view>
          <view class="paragraph">如您对本协议内容存在任何疑问、意见或建议，欢迎通过本软件内置的反馈与投诉渠道与我们取得联系。我们将竭诚为您解答和改进。</view>
        </view>

        <view class="section">
          <view class="section-subtitle">2.本软件及相关服务条款</view>
          <view class="paragraph-title">2.1用户资格与使用限制</view>
          <view class="paragraph">本软件及相关服务主要针对成年用户设计。若您未满18周岁，请在法定监护人的陪同下详细审阅并充分理解本协议，并在征得法定监护人同意后方可使用本软件及相关服务。本软件及相关服务基于生成式人工智能模型及其他可能辅助的模型、服务，旨在为用户提供人工智能生成技术服务等。所生成的内容仅供参考，严禁用于专业建议、商业用途或其他非预定目的。特别是在涉及医疗、财务、投资、保险等重大影响的领域，强烈建议您咨询相关专业人士。本公司不承担因用户依赖输出内容而产生的任何风险或责任。用户应理智、科学地使用生成式人工智能技术，并自行承担由此产生的所有后果。</view>
          <view class="paragraph-title">2.2 服务更新与变动</view>
          <view class="paragraph">为持续提升用户体验及服务安全性，公司有权不定期对本软件及相关服务进行部分或全面的更新、修改或升级，包括但不限于功能增强、新服务开发等。在可行的清况下，公司将通过适当方式通知用户。</view>
          <view class="paragraph-title">2.3服务中止与限制</view>
          <view class="paragraph">用户有权随时终止使用本软件及相关服务。同时，公司也保留随时中止向用户提供服务或增设新的使用限制的权利。</view>
          <view class="paragraph-title">2.4 授权与访问限制</view>
          <view class="paragraph">除非事先获得公司明确的书面授权，用户不得对本软件及相关服务进行任何形式的未经授权访问或使用，包括但不限于改编、复制、传播、垂直搜索、镜像或交易</view>
          <view class="paragraph-title">2.5 终端设备与联网要求</view>
          <view class="paragraph">用户应自行准备访问本软件及相关服务所需的终端设备，并承担因使用服务而产生的联网费用。一旦在终端设备上访问本软件及相关服务，即视为用户已使用本软件及相关服务。</view>
          <view class="paragraph-title">2.6 使用权利与保留权利</view>
          <view class="paragraph">公司授予用户个人的、可撤销的、不可转让的、非独家的和非商业性质的合法使用本软件及相关服务的权利。本协议未明确授予的其他所有权利均由公司保留。用户在行使这些权利前必须获得公司的书面许可。公司未行使任何前述权利并不构成对该权利的放弃。</view>
          <view class="paragraph-title">2.7 内容质量与反馈机制</view>
          <view class="paragraph">公司高度重视人工智能模型生成内容的质量，并将采取合理措施过滤不当内容。若用户发现输出内容或处理结果存在问题，欢迎通过指定反馈渠道进行反馈。对于因用户发布内容引发的侵权投诉及处理，若用户不认可处理结果，应根据公司提示提交相关证明材料进行申诉，公司将依法及时处理。</view>
        </view>
        
        <view class="section">
          <view class="section-subtitle">3.关于账号</view>
          <view class="paragraph-title">3.1账号注册与使用</view>
          <view class="paragraph">本公司通过本软件及相关服务为您提供注册通道。您应选择符合规定的字符组合作为账号，并设置符合安全标准的密码。您所设置的账号、密码以及收到的验证码是您登录本软件并使用相关服务的唯一凭证。特别提醒，本软件及相关服务的核心功能为[AI对话]，该功能需登录账号后方可使用。</view>
          <view class="paragraph-title">3.2 账号注销</view>
          <view class="paragraph">在您决定终止使用本软件账号服务时，需满足以下条件: 您只能申请注销本人账号，并按照本软件的既定流程操作; 注销前及注销过程中的行为所产生的责任仍由您承担; 账号注销成功后，相关信息及功能将无法恢复。 若您需注销账号，请按照提示操作。</view>
          <view class="paragraph-title">3.3 账号规范</view>
          <view class="paragraph">您承诺所注册的账号不违反国家法律法规及公司的相关规定。账号名称、头像等注册信息不得含有违法或不良内容。禁止冒用他人名义注册账号，也不得恶意注册。公司保留审核您提交信息的权利。在使用账号过程中，您必须遵守相关法律法规，不得进行任何侵害他人权益的行为。</view>
          <view class="paragraph-title">3.4 账号归属与使用</view>
          <view class="paragraph">您注册的账号仅限您本人使用。未经公司明确书面同意，禁止以任何形式将账号转让、出租、借用给他人。若公司发现账号使用者并非初始注册人，为保障账号安全，公司有权暂停或终止服务，并可能永久禁用该账号。</view>
          <view class="paragraph-title">3.5 账号安全</view>
          <view class="paragraph">您有责任确保账号、密码及验证码的安全。因您保管不当导致的任何法律责任均由您承担。若发现账号异常，您应立即通知公司。</view>
          <view class="paragraph-title">3.6 密码找回</view>
          <view class="paragraph">若您遗忘密码或验证码，可通过既定途径向公司申诉找回。但您应明白，公司的密码找回机制是基于申诉信息的匹配性，无法完全验证申诉人的真实身份。因此，强烈建议您妥善保管账号相关信息。</view>
          <view class="paragraph-title">3.7 真实身份信息</view>
          <view class="paragraph">在注册、使用和管理账号时，您应确保所填写的身份信息真实、准确。若您提供的信息不真实或不准确，公司有权拒绝或限制您使用本软件及相关服务。</view>
          <view class="paragraph-title">3.8 账号信息管理</view>
          <view class="paragraph">完成注册后，您可随时查看和修改个人身份信息。但出于安全考虑，某些初始注册信息可能无法修改。若您申请注销账号，公司将在验证您的身份后协助完成注销，并删除相关信息(法律法规另有规定的除外)。</view>
          <view class="paragraph-title">3.9 账号回收</view>
          <view class="paragraph">若您在注册后长时间未使用账号，公司有权回收账号以充分利用资源。在回收前，公司将通过适当方式提醒您。若您在收到提醒后一定期限内仍未使用账号，公司将进行回收操作。</view>
        </view>

        <view class="section">
          <view class="section-subtitle">4.用户个人信息保护</view>
          <view class="paragraph">本公司高度重视用户个人信息保护，并将其作为基本原则之一。在使用服务过程中，您可能需要提供个人信息。我们将依法保护您的个人信息权利，并采取必要的安全措施进行保护。更多详情，请参阅《隐私政策》。</view>
        </view>
        
        <view class="section">
          <view class="section-subtitle">5.用户行为规范</view>
          <view class="paragraph-title">5.1用户行为准则</view>
          <view class="paragraph">用户在使用本软件及相关服务时，应当对其行为承担全部责任。除非法律明确允许或经公司明确书面授权，用户在使用本软件及相关服务时，严禁实施以下行为:</view>
          <view class="paragraph">5.1.1未经公司明确授权或同意，不得使用任何插件、外挂、系统或第三方工具，以干扰、破坏、修改或对本软件及相关服务的正常运行施加不当影响。</view>
          <view class="paragraph">5.1.2 严禁利用或针对本软件及相关服务从事任何危害计算机网络安全的活动，包括但不限于: (a)非法侵入网络、干扰网络正常功能、窃取网络数据等危害网络安全的行为; (b)提供专用于网络侵入、干扰网络正常功能及防护措施、窃取网络数据的程序或工具; (c)明知他人从事危害网络安全活动而为其提供技术支持、广告推广、支付结算等协助; (d)使用未授权的数据或访问未授权的服务器/账号; (e)未经授权进入公众计算机网络或他人计算机系统，删除、修改、增加存储信息; (f)未经许可，试图探测、扫描、测试本软件系统或网络的弱点，或实施其他破坏网络安全的行为; (g)试图干扰、破坏本软件系统或网站的正常运行，故意传播恶意程序、病毒，或其他干扰正常网络信息服务的行为; (h)伪造TCP/IP数据包名称或部分名称。</view>
          <view class="paragraph">5.1.3不得对软件及相关服务进行反向工程、反向编译、翻译，或以其他方式尝试发现本软件的源代码、模型、算法和系统的源代码或底层组件。</view>
          <view class="paragraph">5.1.4 严禁恶意注册本软件及相关服务的账号，包括但不限于频繁、批量注册账号。</view>
          <view class="paragraph">5.1.5 未经原始用户明确同意，不得向任何非原始用户展示或以其他方式提供任何用户信息。</view>
          <view class="paragraph">5.1.6 未经明确授权，不得冒充他人或获取对本软件及相关服务的非法访问权。</view>
          <view class="paragraph">5.1.7 严禁利用或针对本软件及相关服务从事诈骗、欺诈、误导或欺骗性活动，包括但不限于网络钓鱼、假冒、剽窃、学术不端等行为。</view>
          <view class="paragraph">5.1.8 必须尊重他人隐私，不得以任何可能侵犯第三方隐私的方式使用本软件及相关服务，例如非法收集或披露个人身份信息、教育、财务或其他受保护记录。</view>
          <view class="paragraph">5.1.9 若公司有合理理由认为用户利用生成式人工智能服务从事违法活动或可能违反上述规定，公司有权在不事先通知的情况下、独立判断并采取相应处置措施，包括但不限于警示、限制功能、暂停或终止服务，并依法追究相关法律责任。</view>
          
          <view class="paragraph-title">5.2 信息内容准则</view>
          <view class="paragraph">5.2.1 公司致力于促进文明、理性、友善、高质量的交流，并不断加强信息安全管理能力，切实履行社会责任，遵守国家法律法规，尊重公民合法权益和社会公序良俗。</view>
          <view class="paragraph">5.2.2 用户在使用本软件及相关服务时输入、输出/生成、制作、评论、上传、发布、传播的信息，应自觉遵守法律法规，尊重社会公德和伦理道德，不得包含以下内容: (a)反对宪法确定的基本原则; (b)危害国家安全和利益，泄露国家秘密 (c)颠覆国家政权，推翻社会主义制度，损害国家形象煽动分裂国家，破坏国家统一和社会稳定; (d)损害国家荣誉和利益; (e)宣扬恐怖主义、极端主义; (f)宣扬民族仇恨、破坏民族团结 (g)宣扬任何形式的歧视、仇恨，包括但不限于基于年龄、性别、宗教、国籍、性取向、健康状况、职业、地域的歧视; (h)从事或协助非法或高风险活动; (i)破坏国家宗教政策，宣扬邪教或封建迷信; (j)编造、散布谣言、虚假信息，扰乱经济和社会秩序; (k)散布暴力、淫秽、色情、赌博、凶杀、恐怖或教唆犯罪内容; (l)利用、伤害或企图利用未成年人，损害其身心健康或合法权益; (m)侮辱、诽谤、冒犯、辱骂、激怒、欺凌或控制他人: (n)对他人进行暴力恐吓、威胁，实施人肉搜索; (o)侵犯他人隐私、个人信息或资料; (p)散布污言秽语，损害社会风气; (q)违反商业道德，侵害商业秘密、知识产权等合法权; (r)散布商业广告、垃圾信息或过度营销内容: (s)使用非本网站常用语言文字评论; (t)发表与所评论信息无关的内容; (u)发表毫无意义的内容，或刻意使用字符组合以规避技术审核; (v)偷拍、偷录他人，侵犯他人合法权利; (w)包含恐怖、暴力血腥、高危险性内容; (x)其他违反法律法规、政策、公序良俗或干扰本软件及相关服务正常运营的内容。</view>
          
          <view class="paragraph-title">5.3 投诉与举报</view>
          <view class="paragraph">用户有权向公司投诉、举报各类违法违规行为、违法传播活动及违法有害信息。公司将及时处理用户的合法投诉和举报，共同维护风清气正的网络空间</view>
        </view>

        <view class="section">
          <view class="section-subtitle">6.信息内容使用规范</view>
          <view class="paragraph">6.1未经本公司明确书面授权，任何用户及第三方均不得擅自或授权他人对本软件及相关服务中的信息内容进行如下行为: (a)复制、读取或采用本软件及相关服务的信息内容，用于商业宣传、增加阅读量、浏览量等任何商业目的; (b)擅自编辑、整理后，在非本软件及相关服务的源页面展示本软件及相关服务的信息内容; (c)利用任何特殊标识、代码等手段，对本软件及相关服务的信息内容产生流量引导、转移、劫持等不利影响: (d)其他任何非法获取或使用本软件及相关服务信息内容的行为;</view>
          <view class="paragraph">6.2 严禁以盗链、冗余盗取、非法抓取、深度链接、假冒注册等任何方式，直接或间接获取本软件及相关服务的文字、图片、视频等信息内容。同时，禁止以任何手文川元息，或删除、隐匿、改变本软件及相关服务中显示的任何专利、版权、商标或其他所有权声明。</view>
          <view class="paragraph">6.3 经公司明确书面许可后，用户及第三方对本软件及相关服务的信息内容进行分享、转发等行为时，必须遵守以下规定: (a)不得将抓取、统计获得的相关数据公示、提供给任何第三方，除非事先获得公司的明确书面同意; (b)不得对本软件及相关服务的源页面进行任何改动，包括但不限于首页链接等入口，也不得进行任何形式的遮挡、插入、弹窗等妨碍行为; (c)应采取严密的安全措施，防止本软件及相关服务的信息内容被非法获取; (d)严禁将数据内容用于公司书面许可范围之外的目的,尤其是销售和商业使用，或向第三方泄露、提供; (e)才字、特友寺们刀儿必须理于么可市炸的具"也相天规汇和标准。</view>
          <view class="paragraph">6.4用户不得利用深度学习等新技术制作、发布、传播虚假信息。在发布或传播基于新技术生成的信息时，应显著标识或提示。同时，不得删除或误导性修改本软件基于新技术添加的标识。</view>
        </view>

        <view class="section">
          <view class="section-subtitle">7.服务的变更、中断和终止</view>
          <view class="paragraph">7.1用户应理解，本软件及相关服务是按照现有技术和条件提供的，并可能受到不可抗力、网络原因、第三方服务瑕疵等因素的影响，导致服务中断或其他损失和风险。公司将尽最大努力提供服务，但无法预见和防范所有技术和其他风险。</view>
          <view class="paragraph">7.2 为了整体服务运营和平台安全，公司有权根据具体请况决定服务/功能的设置、范围、修改、中断、中止或终止。</view>
        </view>
        
        <view class="section">
          <view class="section-subtitle">8.知识产权</view>
          <view class="paragraph">8.1用户在使用本软件及相关服务期间提供的内容，其知识产权归属于用户或相关权利人。公司不主张输出内容的所有权。但如输入和/或输出包含公司的知识产权，则相应权利仍归公司所有。用户授予公司和/或关联方免费、全球、永久的许可，以优化模型和服务。此许可是可转让、可分许可的。用户必须确保输入内容的合法性，不侵犯任何第三方的合法权益。</view>
          <view class="paragraph">8.2 除非另有规定，本软件及相关服务中提供的所有内容的知识产权均归公司所有。未经许可，任何人不得擅自使用本软件及相关服务中的内容。</view>
          <view class="paragraph">8.3用户授予公司和/或关联方使用其通过本软件及相关服务输入、上传、发布、传播的信息内容，用于相关宣传、推广、研究等目的。</view>
          <view class="paragraph">8.4 公司对本软件及相关服务的开发和运营过程中产生的所有数据和信息享有相应权利。用户不得私自使用公司的任何商标、服务标记等品牌特征。</view>
        </view>
        
        <view class="section">
          <view class="section-subtitle">9.违约处理</view>
          <view class="paragraph">9.1对于违反本协议或其他服务条款的行为，公司有权独立判断并采取相应措施，包括但不限于警示、拒绝发布、停止传输、删除内容、限制账号功能直至终止服务、关闭账号等。对于因此造成的任何损失，公司不承担责任，并有权公告处理结果。涉嫌违法犯罪的行为，公司将依法报告并配合调查。</view>
          <view class="paragraph">9.2 用户应自行处理因违反本协议或其他服务条款而引起的第三方投诉或诉讼，并承担全部法律责任。如因此导致公司及其关联方遭受损失，用户应足额赔偿。</view>
          <view class="paragraph">9.3 公司尊重并保护用户及他人的合法权益。用户在使用本软件及相关服务时，不得侵犯任何第三方的知识产权、名誉权等权益。如发生侵权行为，公司有权移除涉嫌侵权内容，并要求用户自行处理并承担法律责任。如因此导致公司及其关联方遭受损失，用户应足额赔偿。</view>
        </view>

        <view class="section">
          <view class="section-subtitle">10.免责声明</view>
          <view class="paragraph">10.1用户理解并同意，本软件及相关服务可能受到多重不可控因素的干扰。因此，公司不保证且明确声明不承担以下责任: (a)本软件及相关服务将完全满足用户个人的特定需求; (b)本软件及相关服务将不受任何形式的干扰，始终保持及时、安全、可靠及无错误状态;用户从公司获取的软件、服务或其他材料将完全符合预期; (c)本软件及相关服务中的所有错误或缺陷都将得到修正。</view>
          <view class="paragraph">10.2 如遇涉及财务交易、投融资活动、理财策略或其他与财产相关的信息、账户凭证、广告宣传或推广材料，请用户谨慎甄别并自主判断其真实性与合法性。对于因用户信赖或使用此类信息而导致的利润损失、商业信誉损害、数据丢失或其他直接或间接的损害，公司不承担任何赔偿责任。</view>
          <view class="paragraph">10.3用户理解并同意，本软件及相关服务的运行可能受到不可抗力事件的影响，包括但不限于自然灾害、政府行为、战争状态、劳工纠纷或社会动乱等。在此类情况下，公司将尽力恢复服务，但对于因不可抗力导致的服务中断、延迟、终止或任何其他损害，公司在法律允许的最大限度内免除责任。</view>
          <view class="paragraph">10.4公司有权依法处理违法违规内容，此权利不构成公司的义务或承诺。公司无法保证及时发现所有违法行为，亦无法承诺对所有违法行为采取相应处理措施。</view>
          <view class="paragraph">10.5用户明确理解并同意，对于本软件及相关服务，公司不提供任何明示或暗示的担保，包括但不限于商业适售性、特定用途适应性等。用户应自行承担使用本软件及相关服务的所有风险。</view>
          <view class="paragraph">10.6 本协议的目的是确保遵守国家法律法规、维护社会秩序、保护用户及他人合法权益。公司将尽最大努力在法律法规允许的范围内进行判断和行动，但无法保证公司的判断与司法机关或行政机关的判断完全一致。因此，用户应自行承担因此产生的任何后果。</view>
          <view class="paragraph">10.7 在任何情况下，无论是否已事先通知用户可能发生的损害，公司及其关联方或许可方均不对任何形式的损害承担赔偿责任，这包括但不限于利润损失、商誉损害、数据丢失等。除非法律法规另有明文规定，否则公司对用户的全部责任，不论起因和形式，均不超过用户在使用本软件及相关服务期间支付给公司的费用总额(如有)。</view>
        </view>

        <view class="section">
          <view class="section-subtitle">11.未成年人使用条款</view>
          <view class="paragraph">11.1若用户是未满18周岁的未成年人，须在监护人的陪同、指导和同意下，仔细阅读并同意本协议后，方可使用本软件及相关服务。</view>
          <view class="paragraph">11.2公司高度重视对未成年人个人信息的保护。未成年用户在提供个人信息时，应增强自我保护意识，并在监护人的指导和同意下正确使用本软件及相关服务。</view>
          <view class="paragraph">11.3未成年用户及其监护人应理解并确认，如因违反法律法规或本协议规定而造成任何法律责任，应由其自行承担。</view>
          <view class="paragraph">11.4特别提示未成年用户:使用本软件及相关服务时请在监护人的陪同和指导下进行，合理安排时间，避免过度沉迷网络，并遵守《全国青少年网络文明公约》的相关规定。</view>
          <view class="paragraph">11.5为保护未成年人隐私权益，请用户在发布涉及未成年人的内容时严格遵守法律法规。一旦发布相关内容即视为已获得权利人的充分授权。公司将依照本协议及相关法律法规使用和处理此类内容。</view>
        </view>

        <view class="section">
          <view class="section-subtitle">12.开源许可</view>
          <view class="paragraph">本软件及相关服务可能包含根据开源许可证或其他许可条款提供的软件组件。用户可查阅《安卓版开源声明》或《i0S版开源声明》以获取更多信息。某些开源许可条款可能对本协议的部分内容具有优先适用性，请用户务必仔细阅读相关许可证。</view>
        </view>
        
        <view class="section">
          <view class="section-subtitle">13.其他条款</view>
          <view class="paragraph">13.1 本协议的成立、生效、履行、解释及争议解决均适用中华人民共和国法律。若本协议的任何条款与中华人民共和国法律相抵触而无效或不可执行，应在不违反法律的前提下，尽可能按照本协议的原意进行解释和适用，且本协议的其他条款仍应保持完整有效。</view>
          <view class="paragraph">13.2 本协议的签订地为中华人民共和国深圳市龙华区。任何因本协议产生的争议，双方应首先通过友好协商解长;协商不成的，应提交全本协议签计地的人民法院进行诉讼解决。</view>
          <view class="paragraph">13.3 为提供更好的服务或适应法律法规、政策调整、技术条件变化等需要，公司有权不时对本协议进行修改。修改后的协议将成为本协议的一部分，并可通过本软件及相关服务的相关页面进行查阅。用户继续使用本软件及相关服务即表示接受修改后的协议内容;若对修改后的协议有异议，请立即停止使用本软件及相关服务。</view>
          <view class="paragraph">13.4 公司有权根据本软件及相关服务的运营需要，单方面决定安排或指定其关联方、控股子公司、继承公司或公司认可的第三方继续运营本软件。同时，对于本协议项下的某些服务，可能会由前述实体向用户提供。用户接受相关服务内容即视为同意受本协议约束。</view>
          <view class="paragraph">13.5 本协议中的标题仅为方便阅读而设，并不影响本协议中任何条款的含义或解释。</view>
          <view class="paragraph">13.6 用户与公司均为独立法律主体，本协议不构成双方之间的任何代理、合伙、合资或雇佣关系。在任何情况下，本协议均不构成公司对用户的任何明示或暗示担保或条件。</view>
        </view>
      </view>
    </scroll-view>
  </view>
</template>

<script setup>
function backPage() {
  const pages = getCurrentPages();
  if (pages.length > 1) {
    uni.navigateBack({
      delta: 1
    });
  } else {
    uni.switchTab({
      url: '/pages/table/aiIndex/ai_index'
    });
  }
}
</script>

<style lang="scss" scoped>
.container {
  display: flex;
  flex-direction: column;
  min-height: 100vh;
  background-color: #ffffff;
  padding-top: var(--status-bar-height);
  box-sizing: border-box;
}

.content-scroll {
  flex: 1;
}

.content {
  padding-bottom: 50rpx;
}

.section-title {
  font-size: 40rpx;
  font-weight: bold;
  margin-bottom: 20rpx;
  color: #333;
  text-align: center;
}

.section {
  margin-bottom: 40rpx;
}

.section-subtitle {
  font-size: 32rpx;
  font-weight: bold;
  color: #333;
  margin-bottom: 20rpx;
}

.paragraph-title {
  font-size: 30rpx;
  font-weight: bold;
  color: #333;
  margin-bottom: 20rpx;
}

.paragraph {
  font-size: 28rpx;
  color: #333;
  line-height: 1.8;
  text-align: justify;
  margin-bottom: 20rpx;
}
</style>
